/**
  ************************************* Copyright ******************************
  *  
  *                         (C) Copyright 2023,,China.
  *                                 All Rights Reserved
  *                              
  *                            By(ܵӿƼ޹˾)
  *                     
  *      
  * ļ       : dma.h   
  * 汾         : v1.0		
  *          : 			
  * ʱ         : 2023-01-29         
  *          :    
  * б     :  
  	1. ....
  	      <汾>: 		
      <޸Ա>:
  		  <ʱ>:
          <>:  
  	2. ...
  ******************************************************************************
 */


#ifndef __DMA_H
/* 宏定义说明：__DMA_H，头文件重复包含保护宏。 */
#define	__DMA_H

/* 函数声明说明：MYDMA_Config，DMA初始化或中断处理函数。 */
void MYDMA_Config(void);//DMA1
#endif
